{"class_name": "Model", "config": {"name": "vae_mlp", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["encoder_input", 0, 0, {}]]}, {"name": "z_mean", "class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dense", 0, 0, {}]]}, {"name": "z_log_var", "class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dense", 0, 0, {}]]}, {"name": "z", "class_name": "Lambda", "config": {"name": "z", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABgAAAAQAAABDAAAAc04AAAB8AFwCfQF9AnQAagF8AYMBZAEZAH0DdABqAXwBgwFk\nAhkAfQR0AGoCagN8A3wEZgJkA40BfQV8AXQAagRqBWQEfAIUAIMBfAUUABcAUwApBfrMUmVwYXJh\nbWV0ZXJpemF0aW9uIHRyaWNrIGJ5IHNhbXBsaW5nIGZyIGFuIGlzb3Ryb3BpYyB1bml0IEdhdXNz\naWFuLgoKICAgICMgQXJndW1lbnRzCiAgICAgICAgYXJncyAodGVuc29yKTogbWVhbiBhbmQgbG9n\nIG9mIHZhcmlhbmNlIG9mIFEoenxYKQoKICAgICMgUmV0dXJucwogICAgICAgIHogKHRlbnNvcik6\nIHNhbXBsZWQgbGF0ZW50IHZlY3RvcgogICAg6QAAAADpAQAAACkB2gVzaGFwZecAAAAAAADgPykG\n2gJ0ZnIEAAAA2gZyYW5kb23aBm5vcm1hbNoEbWF0aNoDZXhwKQbaBGFyZ3PaBnpfbWVhbtoJel9s\nb2dfdmFy2gViYXRjaNoDZGlt2gdlcHNpbG9uqQByEQAAAPpWL2hvbWUvdHlsZXIvUHJvamVjdHMv\nZ2VuZXJhdGl2ZS1kYXRhLWF1Z21lbnRhdGlvbi9tbmlzdF9leHBlcmltZW50cy90cmFpbl92YWVf\nbW5pc3QucHnaCHNhbXBsaW5nFgAAAHMKAAAAAAoIAQ4BDgISAQ==\n", null, null], "module": "__main__", "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": ["encoder_input", 0, 0], "output_layers": [["z_mean", 0, 0], ["z_log_var", 0, 0], ["z", 0, 0]]}, "inbound_nodes": [["encoder_input", 0, 0, {}]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["z_sampling", 0, 0, {}]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dense_1", 0, 0, {}]]}], "input_layers": ["z_sampling", 0, 0], "output_layers": ["dense_2", 0, 0]}, "inbound_nodes": [["encoder", 1, 2, {}]]}], "input_layers": ["encoder_input", 0, 0], "output_layers": ["decoder", 1, 0]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}